[["0",{"pageContent":"Latest Income Tax Slab and Rates - FY 2023-24 | AY 2024-25","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":1,"to":1}}}}],["1",{"pageContent":"Finance Minister Nirmala Sitharaman announced changes in income tax slab rates under the new tax regime, in Budget 2023. The changes announced on February 1, 2023, will become applicable from April 1, 2023, for FY 2023-24 once the proposals are passed by Parliament. For the financial year 2023-24, which starts on April 1, 2023, the changes announced in the new tax regime are as follows: The basic exemption limit hiked to Rs 3 lakh from Rs 2.5 lakh under the new income regimeNew tax regime becomes the default option for taxpayers. However, they have the option to opt for the old tax regimeIncome","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":3,"to":3}}}}],["2",{"pageContent":"new tax regime are as follows: The basic exemption limit hiked to Rs 3 lakh from Rs 2.5 lakh under the new income regimeNew tax regime becomes the default option for taxpayers. However, they have the option to opt for the old tax regimeIncome tax slabs have been revised under the new tax regimeStandard deduction of Rs 50,000 was introduced for salaried and pensioners under the new tax regime Rebate under Section 87A increased under the new tax regime for taxable incomes not exceeding Rs 7 lakh. Thus, individuals whose taxable income does not exceed Rs 7 lakh will not have to pay any taxes if they","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":3,"to":3}}}}],["3",{"pageContent":"under the new tax regime Rebate under Section 87A increased under the new tax regime for taxable incomes not exceeding Rs 7 lakh. Thus, individuals whose taxable income does not exceed Rs 7 lakh will not have to pay any taxes if they opt for the new tax regime in FY 2023-24. Highest surcharge rate was reduced to 25% from 37% under the new tax regime. No changes have been made under the old tax regime for FY 2023-24. The income tax slab and rates under the old tax regime remain unchanged for FY 2023-24. Also, no changes have been announced in the deductions and exemptions that are available under the old","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":3,"to":3}}}}],["4",{"pageContent":"been made under the old tax regime for FY 2023-24. The income tax slab and rates under the old tax regime remain unchanged for FY 2023-24. Also, no changes have been announced in the deductions and exemptions that are available under the old tax regime. A rebate under Section 87A is available under the old tax regime if taxable income does not exceed Rs 5 lakh. Till FY 2019-20 (ended on March 31, 2020), there was only one tax regime with four tax slabs and tax rates. An individual can bring down the gross taxable income by claiming deductions under sections such as 80C, 80D, 80TTA, and 80TTB, and tax","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":3,"to":3}}}}],["5",{"pageContent":"Till FY 2019-20 (ended on March 31, 2020), there was only one tax regime with four tax slabs and tax rates. An individual can bring down the gross taxable income by claiming deductions under sections such as 80C, 80D, 80TTA, and 80TTB, and tax exemptions on house rent allowance, leave travel concession, etc.The old tax regime offered multiple basic income exemption limits depending on the age of the taxpayer. For individuals below 60 years of age, the basic income exemption limit is Rs 2.5 lakh. For senior citizens aged 60 years and above but below 80 years, the basic exemption limit is Rs 3","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":3,"to":3}}}}],["6",{"pageContent":"exemption limits depending on the age of the taxpayer. For individuals below 60 years of age, the basic income exemption limit is Rs 2.5 lakh. For senior citizens aged 60 years and above but below 80 years, the basic exemption limit is Rs 3 lakh. For super senior citizens aged 80 years and above, the basic exemption limit is Rs 5 lakh. From FY 2020-21, a new, concessional tax regime has been introduced. This tax regime has been revised from FY 2023-24. The new tax regime has lower tax rates as compared with the old tax regime. If individuals opt for the new tax regime, they have to forgo approximately","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":3,"to":3}}}}],["7",{"pageContent":"tax regime has been introduced. This tax regime has been revised from FY 2023-24. The new tax regime has lower tax rates as compared with the old tax regime. If individuals opt for the new tax regime, they have to forgo approximately 70 commonly availed tax deductions and exemptions. The new tax regime has become the default option from FY 2023-24. However, an individual or Hindu Undivided Family (HUF) has to choose between the old tax regime and the new tax regime every financial year. This is applicable if they do not have any business income.If an individual taxpayer or HUF has a business","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":3,"to":3}}}}],["8",{"pageContent":"an individual or Hindu Undivided Family (HUF) has to choose between the old tax regime and the new tax regime every financial year. This is applicable if they do not have any business income.If an individual taxpayer or HUF has a business income, these taxpayers are allowed to opt for the new income tax regime. However, once opted in, they only have a once-in-a-lifetime opportunity to switch back to the old tax regime. Once they have switched back, they cannot opt for the new income tax regime in future financial years.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":3,"to":3}}}}],["9",{"pageContent":"Income tax slabs for FY 2023-24 (AY 2024-25) under the new tax regime","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":5,"to":5}}}}],["10",{"pageContent":"Budget 2023 has announced changes in the income tax slabs in the new tax regime. The changes in the income tax slabs have been made to make it more attractive for individual taxpayers. The budget has hiked the basic exemption limit to Rs 3 lakh from Rs 2.5 lakh. Do note that the new income tax slabs in the new tax regime will come into effect from April 1, 2023. Further, the new income tax slabs and changes in rates will apply to incomes earned in FY 2023-24; starting from April 1, 2023. Here are the income tax slabs under new tax regime. Income tax slabs under new tax regime for FY 2023-24","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":7,"to":7}}}}],["11",{"pageContent":"Income tax slabs (Rs)\r\n\r\nIncome tax rate (%)\r\n\r\nFrom 0 to 3,00,000 0\r\n\r\nFrom 3,00,001 to 6,00,000 5\r\n\r\nFrom 6,00,001 to 9,00,000 10\r\n\r\nFrom 9,00,001 to 12,00,000 15\r\n\r\nFrom 12,00,001 to 15,00,000 20\r\n\r\nFrom 15,00,001 and above 30\r\n\r\nChanges announced in the new tax regime for FY 2023-24Given below are the changes that are announced in the new tax regime to make it more attractive:","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":9,"to":25}}}}],["12",{"pageContent":"From 15,00,001 and above 30\r\n\r\nChanges announced in the new tax regime for FY 2023-24Given below are the changes that are announced in the new tax regime to make it more attractive:\r\n\r\nNew income tax regime becomes the default tax regime. Thus, unless an individual specifically opts for the old tax regime, their incomes will be taxed at the new tax regime's slabs and rates","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":25,"to":29}}}}],["13",{"pageContent":"Rebate under Section 87A has been increased to taxable income of Rs 7 lakh (tax rebate of 25,000) from 5 lakh (tax rebate of Rs 12,500). This effectively means that any individual opting for the new tax regime with taxable income of up to Rs 7 lakh will not pay any taxes. Earlier, this tax rebate was available till taxable income of Rs 5 lakh Basic exemption limit has been hiked to Rs 3 lakh from Rs 2.5 lakh in the new tax regime The number of income tax slabs under the new tax regime has been reduced to five from six Standard deduction of Rs 50,000 has been introduced under the new tax regime for salaried","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":31,"to":31}}}}],["14",{"pageContent":"has been hiked to Rs 3 lakh from Rs 2.5 lakh in the new tax regime The number of income tax slabs under the new tax regime has been reduced to five from six Standard deduction of Rs 50,000 has been introduced under the new tax regime for salaried and pensioners Family pensioners can also claim standard deduction of Rs 15,000 under the new tax regime Highest surcharge rate of 37% has been reduced to 25% under the new tax regime","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":31,"to":31}}}}],["15",{"pageContent":"Income tax slabs under the new tax regime till FY 2022-23 (AY 2023-24)For FY 2022-23 (ending on March 31, 2023) and prior to that, the income tax slabs under the new tax regime are different from those mentioned above. It is important to note that a person earning any income in FY 2022-23, i.e., between April 1, 2022 and March 31, 2023, and planning to opt for the new tax regime will have to calculate income tax on the basis of the following income tax slabs: Income tax slabs in new tax regime till FY 2022-23","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":33,"to":33}}}}],["16",{"pageContent":"Income tax slabs (Rs)\r\n\r\nIncome tax rate (%)\r\n\r\nFrom 0 to 2,50,000 0\r\n\r\nFrom 2,50,001 to 5,00,000 5\r\n\r\nFrom 5,00,001 to 7,50,000 10\r\n\r\nFrom 7,50,001 to 10,00,000 15\r\n\r\nFrom 10,00,001 to 12,50,000 20\r\n\r\nFrom 12,50,001 to 15,00,000 25\r\n\r\nFrom 15,00,001 and above 30\r\n\r\nThe above income tax slabs are applicable for financial years FY 2020-21 (AY 2021-22), FY 2021-22 (AY 2022-23) and FY 2022-23 (AY 2023-24).","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":35,"to":53}}}}],["17",{"pageContent":"Income tax slab rates for FY 2023-24 (AY2024-25), FY 2022-23 (AY 2023-24), FY 2021-22 (AY 2022-23) under old tax regime Budget 2023 announced no changes in the old tax regime. Thus, anyone opting for the old tax regime will continue to calculate the income tax payable under the same tax rates in FY 2023-24 (April 1, 2023 - March 31, 2024) as in FY 2022-23 (April 1, 2022-March 31, 2023). Given below are the income tax rates for FY 2023-24 (AY 2024-25), FY 2022-23 (AY 2023-24) and FY 2021-22 (AY 2022-23) under the old tax regime. The basic exemption limit depends on the age of an individual and status","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":55,"to":55}}}}],["18",{"pageContent":"1, 2022-March 31, 2023). Given below are the income tax rates for FY 2023-24 (AY 2024-25), FY 2022-23 (AY 2023-24) and FY 2021-22 (AY 2022-23) under the old tax regime. The basic exemption limit depends on the age of an individual and status of an individual. For an individual below 60 years of age, the basic exemption limit is of Rs 2.5 lakh. For senior citizens (aged 60 years and above but below 80 years) the basic income exemption limit is of Rs 3 lakh. For super senior citizens (aged 80 years and above), the basic income exemption limit is Rs 5 lakh. For non-resident individuals, the basic income","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":55,"to":55}}}}],["19",{"pageContent":"(aged 60 years and above but below 80 years) the basic income exemption limit is of Rs 3 lakh. For super senior citizens (aged 80 years and above), the basic income exemption limit is Rs 5 lakh. For non-resident individuals, the basic income exemption limit is of Rs 2.5 lakh irrespective of age. Income tax slabs for individuals under old tax regime","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":55,"to":55}}}}],["20",{"pageContent":"Income tax slabs (Rs)\r\n\r\nIncome tax rates (%)\r\n\r\nFrom 0 to 2,50,000 0\r\n\r\nFrom 2,50,001 to 5,00,000 5\r\n\r\nFrom 5,00,001 to 10,00,000 20\r\n\r\nFrom 10,00,001 and above 30\r\n\r\nIncome tax slabs for senior citizens under old tax regime\r\n\r\nIncome tax slabs (Rs)\r\n\r\nIncome tax rates (%)\r\n\r\nFrom 0 to 3,00,000 0\r\n\r\nFrom 3,0,001 to 5,00,000 5\r\n\r\nFrom 5,00,001 to 10,00,000 20\r\n\r\nFrom 10,00,001 and above 30\r\n\r\nIncome tax slabs for super senior citizens under old tax regime\r\n\r\nIncome tax slabs (Rs)\r\n\r\nIncome tax rates (%)","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":57,"to":87}}}}],["21",{"pageContent":"From 3,0,001 to 5,00,000 5\r\n\r\nFrom 5,00,001 to 10,00,000 20\r\n\r\nFrom 10,00,001 and above 30\r\n\r\nIncome tax slabs for super senior citizens under old tax regime\r\n\r\nIncome tax slabs (Rs)\r\n\r\nIncome tax rates (%)\r\n\r\nFrom 0 to 5,00,000 0\r\n\r\nFrom 5,00,001 to 10,00,000 20\r\n\r\nFrom 10,00,001 and above 30","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":87,"to":103}}}}],["22",{"pageContent":"How to calculate income tax payable under new tax regime If you have decided to opt for the new tax regime for the current financial year, i.e., FY 2022-23, then here's how to calculate the income tax payable.Do note under the new tax regime, an individual is eligible to claim deduction only under section 80CCD (2) of the Income-tax Act, 1961. No other deduction or tax exemption can be claimed under the new tax regime.Here is an example of how to calculate income tax payable under the new tax regime.Suppose an individual's gross total income is Rs 20 lakh in FY 2022-23. Further, his/her employer","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":105,"to":105}}}}],["23",{"pageContent":"or tax exemption can be claimed under the new tax regime.Here is an example of how to calculate income tax payable under the new tax regime.Suppose an individual's gross total income is Rs 20 lakh in FY 2022-23. Further, his/her employer has deposited Rs 1.5 lakh in his/her Tier-I NPS account. This makes him eligible to claim deduction under section 80CCD(2) of the Income-tax Act. Calculating net taxable income under new tax regime","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":105,"to":105}}}}],["24",{"pageContent":"Particulars Amount (In Rs)\r\n\r\nGross total income 20,00,000\r\n\r\nDeduction under section 80CCD (2) 1,50,000\r\n\r\nNet taxable income 18,50,000","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":107,"to":113}}}}],["25",{"pageContent":"Hence, the net taxable income on which income tax payable is to be calculated will be Rs 18.50 lakh (Rs 20 lakh minus Rs 1.5 lakh). Under the new income tax regime, income up to Rs 2,50,000 is exempted from tax. Hence, no tax will be payable on this income. Post this, the income left which is still chargeable to tax is Rs 16,00,000 (Rs 18,50,000 minus Rs 2,50,000).The next slab is between Rs 2.5 lakh and up to Rs 5 lakh. Thus, out of Rs 16,00,000, Rs 2.5 lakh (Rs 5 lakh minus Rs 2.5 lakh) will be taxed at 5%. The tax payable here will be Rs 12,500. Post this, the income left which is still chargeable to tax is Rs","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":115,"to":115}}}}],["26",{"pageContent":"next slab is between Rs 2.5 lakh and up to Rs 5 lakh. Thus, out of Rs 16,00,000, Rs 2.5 lakh (Rs 5 lakh minus Rs 2.5 lakh) will be taxed at 5%. The tax payable here will be Rs 12,500. Post this, the income left which is still chargeable to tax is Rs 13,50,000 (Rs 16,00,000 minus Rs 2,50,000). The next slab is between Rs 5 lakh and up to Rs 7.5 lakh. Out of Rs 13,50,000, the next Rs 2.5 lakh (Rs 7.5 lakh minus Rs 5 lakh) will be taxed at 10%. The income tax payable comes out to be Rs 25,000.The balance income left is Rs 11,00,000 (Rs 13,50,000 minus Rs 2,50,000). The next slab under the income tax regime is between Rs","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":115,"to":115}}}}],["27",{"pageContent":"next Rs 2.5 lakh (Rs 7.5 lakh minus Rs 5 lakh) will be taxed at 10%. The income tax payable comes out to be Rs 25,000.The balance income left is Rs 11,00,000 (Rs 13,50,000 minus Rs 2,50,000). The next slab under the income tax regime is between Rs 7.5 lakh and up to Rs 10 lakh. Hence, out of Rs 11,00,000, the Rs 2.5 lakh (Rs 10 lakh minus Rs 7.5 lakh) will be taxed at 15%. The tax payable amount will be Rs 37,500.The balance income left which is still chargeable to tax is Rs 8,50,000 (Rs 11,00,000 minus Rs 2.5 lakh). The next slab is between Rs 10 lakh and up to Rs 12,50,000. Out of Rs 8,50,000, the next Rs","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":115,"to":115}}}}],["28",{"pageContent":"at 15%. The tax payable amount will be Rs 37,500.The balance income left which is still chargeable to tax is Rs 8,50,000 (Rs 11,00,000 minus Rs 2.5 lakh). The next slab is between Rs 10 lakh and up to Rs 12,50,000. Out of Rs 8,50,000, the next Rs 2,50,000 will be taxed at Rs 20%. The tax payable amount will be Rs 50,000. The balance income left that is still chargeable to Rs tax is Rs 6,00,000 (Rs 8,50,000 minus Rs 2,50,000). The next slab is between Rs 12,50,000 and Rs 15,00,000). Out of Rs 6,00,000, the next Rs 2,50,000 (Rs 15,00,000 minus Rs 12,50,000) will be taxed at 25%. The tax payable amount will be","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":115,"to":115}}}}],["29",{"pageContent":"to Rs tax is Rs 6,00,000 (Rs 8,50,000 minus Rs 2,50,000). The next slab is between Rs 12,50,000 and Rs 15,00,000). Out of Rs 6,00,000, the next Rs 2,50,000 (Rs 15,00,000 minus Rs 12,50,000) will be taxed at 25%. The tax payable amount will be Rs 62,500. Now the balance income which is left is Rs 3,50,000 (Rs 6,00,000 minus Rs 2,50,000). This will be taxed as per the last slab, i.e., above Rs 15,00,000 at 30% tax rate. The tax payable amount will be Rs 1,05,000. Calculation of income tax payable for taxable income of Rs 18.50 lakh","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":115,"to":115}}}}],["30",{"pageContent":"Particulars Income (Rs) Tax amount (Rs)\r\n\r\nNet taxable income 18,50,000 -\r\n\r\nIncome exempt up to Rs 2,50,000 (2,50,000) 0\r\n\r\nIncome which is still chargeable to tax (Rs 18,50,000 - 2,50,000) 16,00,000 -\r\n\r\nIncome tax slab of Rs 2.5 lakh and up to Rs 5 lakh\r\n\r\n(2,50,000) @ 5% =12,500\r\n\r\nIncome which is still chargeable to tax (Rs 16,00,000 - 2,50,000) 13,50,000 -\r\n\r\nIncome tax slab of Rs 5 lakh up to Rs 7.5 lakh (2,50,000) @ 10% = 25,000","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":117,"to":131}}}}],["31",{"pageContent":"(2,50,000) @ 5% =12,500\r\n\r\nIncome which is still chargeable to tax (Rs 16,00,000 - 2,50,000) 13,50,000 -\r\n\r\nIncome tax slab of Rs 5 lakh up to Rs 7.5 lakh (2,50,000) @ 10% = 25,000\r\n\r\nIncome which is still chargeable to tax (Rs 13,50,000 -2,50,000) 11,00,000 -\r\n\r\nIncome tax slab of Rs 7.5 lakh up to Rs 10 lakh (2,50,000) @15% = 37,500\r\n\r\nIncome which is still chargeable to tax (Rs 11,00,000 -2,50,000) 8,50,000 -\r\n\r\nIncome tax slab of Rs 10 lakh up to Rs 12.50 lakh (2,50,000) @ 20% = 50,000","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":131,"to":143}}}}],["32",{"pageContent":"Income which is still chargeable to tax (Rs 11,00,000 -2,50,000) 8,50,000 -\r\n\r\nIncome tax slab of Rs 10 lakh up to Rs 12.50 lakh (2,50,000) @ 20% = 50,000\r\n\r\nIncome which is still chargeable to tax (Rs 8,50,000 -2,50,000) 6,00,000 -\r\n\r\nIncome tax slab of Rs 12.50 lakh up to Rs 15 lakh (2,50,000) @25% = 62,500\r\n\r\nIncome which is still chargeable to tax (Rs 6,00,000-2,50,000) 3,50,000 -\r\n\r\nIncome tax slab of above Rs 15 lakh (3,50,000) @30% = 1,05,000\r\n\r\nTotal income tax liability - 2,92,500","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":143,"to":155}}}}],["33",{"pageContent":"Income which is still chargeable to tax (Rs 6,00,000-2,50,000) 3,50,000 -\r\n\r\nIncome tax slab of above Rs 15 lakh (3,50,000) @30% = 1,05,000\r\n\r\nTotal income tax liability - 2,92,500\r\n\r\nCess at 4% on total income tax payable (i.e. on Rs 2,92,500) - 11,700\r\n\r\nFinal income tax liability (inclusive of cess) - 3,04,200","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":155,"to":163}}}}],["34",{"pageContent":"Total income tax liability - 2,92,500\r\n\r\nCess at 4% on total income tax payable (i.e. on Rs 2,92,500) - 11,700\r\n\r\nFinal income tax liability (inclusive of cess) - 3,04,200\r\n\r\nThe total tax payable amount comes to Rs 2,92,500. One must note that cess and surcharge amount is yet to be added.Cess is levied at the rate of 4% on the income tax payable. The surcharge is applicable if the income is above Rs 50 lakh. After adding cess of Rs 11,700, the final tax amount is Rs 3,04,200.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":163,"to":169}}}}],["35",{"pageContent":"How to calculate income tax liability under old tax regime If you have decided to opt for the old tax regime for the current financial year, then it is important to know which income tax slab your income falls under. The slab rate applicable to your income will determine the tax rate at which the last rupee of your income will be taxed at. Under the old income tax regime, an individual taxpayer can claim various deductions and tax exemptions to bring down their gross total income. Once eligible tax exemptions and deductions are deducted from the gross total income, then you will arrive at net","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":171,"to":171}}}}],["36",{"pageContent":"tax regime, an individual taxpayer can claim various deductions and tax exemptions to bring down their gross total income. Once eligible tax exemptions and deductions are deducted from the gross total income, then you will arrive at net taxable income. It is on this income, an individual will calculate tax payable.Here is an example on how to calculate income tax payable under the old tax regime.Suppose an individual aged below 60 years has a gross total income of Rs 17 lakh for the current financial year, i.e., FY 2022-23. An individual has decided to opt for the old tax regime for the current","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":171,"to":171}}}}],["37",{"pageContent":"tax payable under the old tax regime.Suppose an individual aged below 60 years has a gross total income of Rs 17 lakh for the current financial year, i.e., FY 2022-23. An individual has decided to opt for the old tax regime for the current financial year. Further, he/she is eligible to claim following tax exemption and deductions - section 80C for up to Rs 1.5 lakh, section 80CCD(1b) for NPS investment of Rs 50,000, section 80D of Rs 25,000 for medical insurance premium paid and section 80TTA of Rs 10,000 on savings account interest earned. Calculating net taxable income under old tax regime","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":171,"to":171}}}}],["38",{"pageContent":"Particulars Amount (in Rs)\r\n\r\nGross total income 17,00,000\r\n\r\nSection 80C (1,50,000)\r\n\r\nSection 80 CCD(1b) NPS investment (50,000)\r\n\r\nSection 80D – medical insurance premium (25,000)\r\n\r\nSection 80TTA (10,000)\r\n\r\nNet taxable income 14,65,000","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":173,"to":185}}}}],["39",{"pageContent":"After deducting the deductions from the gross total income, one arrives at the net taxable income of Rs 14,65,000. The tax payable will be calculated on the net taxable income.As per the income tax slab rates table, the first Rs 2.5 lakh from net taxable income will be exempted from tax. This is because there is no tax on income up to Rs 2.5 lakh as per current income tax slabs. Post this, income left on which tax has to be calculated is Rs 12,15,000 (14,65,000-2,50,000). The second slab in the income tax slab table is Rs 2.5 lakh and Rs 5 lakh which is taxed at Rs 5%. This means that out of Rs 12,15,000,","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":187,"to":187}}}}],["40",{"pageContent":"tax slabs. Post this, income left on which tax has to be calculated is Rs 12,15,000 (14,65,000-2,50,000). The second slab in the income tax slab table is Rs 2.5 lakh and Rs 5 lakh which is taxed at Rs 5%. This means that out of Rs 12,15,000, then next Rs 2,50,000 will be taxed at 5%. The tax amount will be Rs 12,500.Now the income left which is still chargeable to tax is Rs 9,65,000. The third slab in the income tax slab table is Rs 5 lakh and Rs 10 lakh, taxed at 20%. This means that out Rs 9,65,000, Rs 5,00,000 will be taxed at 20%. The tax payable here will be Rs 1,00,000.The balance income on which tax has to","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":187,"to":187}}}}],["41",{"pageContent":"is Rs 9,65,000. The third slab in the income tax slab table is Rs 5 lakh and Rs 10 lakh, taxed at 20%. This means that out Rs 9,65,000, Rs 5,00,000 will be taxed at 20%. The tax payable here will be Rs 1,00,000.The balance income on which tax has to be calculated is Rs 4,65,000. The tax amount on this balance income (Rs 14,65,000 minus Rs 10,00,000) will be calculated on the basis of the last slab, i.e., above Rs 10 lakh at the rate of 30%. The tax payable amount comes out to be Rs 1,39,500.Hence, the total tax payable by an individual will be Rs 2,52,000 (Rs 12,500 + 1,00,000+ 1,39,500). Calculation of","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":187,"to":187}}}}],["42",{"pageContent":"on the basis of the last slab, i.e., above Rs 10 lakh at the rate of 30%. The tax payable amount comes out to be Rs 1,39,500.Hence, the total tax payable by an individual will be Rs 2,52,000 (Rs 12,500 + 1,00,000+ 1,39,500). Calculation of income tax payable for taxable income of Rs 14.65 lakh","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":187,"to":187}}}}],["43",{"pageContent":"Particulars Income (Rs) Tax amount (Rs)\r\n\r\nNet taxable income 14,65,000 -\r\n\r\nIncome exempt up to Rs 2,50,000 (2,50,000) 0\r\n\r\nIncome which is still chargeable to tax (Rs 14,65,000 - 2,50,000) 12,15,000 -\r\n\r\nIncome tax slab of Rs 2.5 lakh and up to Rs 5 lakh (2,50,000) @ 5% =12,500\r\n\r\nIncome which is still chargeable to tax (Rs 12,15,000 - 2,50,000) 9,65,000 -\r\n\r\nIncome tax slab of Rs 5 lakh up to Rs 10 lakh (5,00,000) @20% = 1,00,000","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":189,"to":201}}}}],["44",{"pageContent":"Income which is still chargeable to tax (Rs 12,15,000 - 2,50,000) 9,65,000 -\r\n\r\nIncome tax slab of Rs 5 lakh up to Rs 10 lakh (5,00,000) @20% = 1,00,000\r\n\r\nIncome which is still chargeable to tax (Rs 9,65,000 - 5,00,000) 4,65,000 -\r\n\r\nIncome tax slab of above Rs 10 lakh (4,65,000) @ 30% =1,39,500\r\n\r\nTotal income tax liability - 2,52,000\r\n\r\nCess at 4% on total income tax payable (i.e. on Rs 2,52,000) - 10,080\r\n\r\nFinal income tax liability (inclusive of cess) - 2,62,080","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":201,"to":213}}}}],["45",{"pageContent":"Final income tax liability (inclusive of cess) - 2,62,080\r\n\r\nDo note that cess and surcharge are also levied on the income tax payable. Cess is levied at the rate of 4% and surcharge is levied if the total income exceeds Rs 50 lakh. From the example above, the cess amount is Rs 10,080. The surcharge will not be applicable as net taxable income does not exceed Rs 50 lakh. The final tax amount payable by individual is Rs 2,62,080.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":213,"to":215}}}}],["46",{"pageContent":"How to know which income tax slab you fall in To calculate the income tax payable in a particular financial year, one needs to know the tax slabs their income falls in. Also, it will also depend on the income tax regime chosen by him/her in a particular financial year. An individual will compare the income tax payable in both the tax regimes before choosing the one.To know the income tax slabs and rates applicable to your income, one must first know the taxable income on which tax has to be calculated. If an individual continues with old, existing income tax regime, then he/she is eligible to claim","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":217,"to":217}}}}],["47",{"pageContent":"one.To know the income tax slabs and rates applicable to your income, one must first know the taxable income on which tax has to be calculated. If an individual continues with old, existing income tax regime, then he/she is eligible to claim tax exemption (such as House Rent Allowance exemption, Leave Travel Allowance exemption, standard deduction) and deductions under sections 80C to 80U, as eligible for. After claiming and deducting the tax exemptions and deductions that an individual is eligible for, he/she arrives at the taxable income on which income tax payable is calculated. For","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":217,"to":217}}}}],["48",{"pageContent":"deductions under sections 80C to 80U, as eligible for. After claiming and deducting the tax exemptions and deductions that an individual is eligible for, he/she arrives at the taxable income on which income tax payable is calculated. For example, your total income from all sources is Rs 12 lakh. You are eligible to claim deduction of Rs 2.10 lakh under sections 80C, 80TTA, 80CCD(1b). The taxable income on which you have to calculate tax will be Rs 9.9 lakh (Rs 12 lakh - Rs 2.10 lakh). Your income tax slab in the old tax regime will be between Rs 5 lakh and Rs 10 lakh. The tax rate is the 20%.However, if","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":217,"to":217}}}}],["49",{"pageContent":"80C, 80TTA, 80CCD(1b). The taxable income on which you have to calculate tax will be Rs 9.9 lakh (Rs 12 lakh - Rs 2.10 lakh). Your income tax slab in the old tax regime will be between Rs 5 lakh and Rs 10 lakh. The tax rate is the 20%.However, if he/she opts for a new, concessional tax regime, then one cannot claim the tax exemption and deductions mentioned above. From the example above, the taxable income will be Rs 12 lakh on which tax payable will be calculated. Under the new tax regime, an individual's income falls under the slab of Rs 10,00,001 and Rs 12,50,000. The tax rate here also is 20%.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":217,"to":217}}}}],["50",{"pageContent":"Surcharge on income tax If an individual's net taxable income exceeds a specified level, then a surcharge is levied. The surcharge is levied on the income tax payable amount before the levy of cess. According to income tax laws, a surcharge is applicable if an individual's taxable income exceeds Rs 50 lakh.In Budget 2023, the government announced multiple surcharge rates under the new tax regime. The new surcharge rates will be applicable from FY 2023-24 and come into effect from April 1, 2023. Surcharge rate from April 1, 2023 under new tax regime","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":219,"to":219}}}}],["51",{"pageContent":"Income range Surcharge rate\r\n\r\nUp to Rs 50 lakh Nil\r\n\r\nMore than Rs 50 lakh but up to Rs 1 crore 10%\r\n\r\nMore than Rs 1 crore but up to Rs 2 crore 15%\r\n\r\nMore than Rs 2 crore 25%\r\n\r\nHowever, individuals opting for the old tax regime in FY 2023-24 will continue to pay the surcharge rate they were paying in the previous financial years. Surcharge rate under old tax regime\r\n\r\nIncome range Surcharge rate\r\n\r\nUpto Rs 50 lakh Nil\r\n\r\nMore than Rs 50 lakh but up to Rs 1 crore 10%","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":221,"to":237}}}}],["52",{"pageContent":"Income range Surcharge rate\r\n\r\nUpto Rs 50 lakh Nil\r\n\r\nMore than Rs 50 lakh but up to Rs 1 crore 10%\r\n\r\nMore than Rs 1 crore but up to Rs 2 crore 15%\r\n\r\nMore than Rs 2 crore but up to Rs 5 crore 25%\r\n\r\nMore than Rs 5 crore 37%","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":237,"to":247}}}}],["53",{"pageContent":"There are certain exceptions to the surcharge rates mentioned above. If an individual has earned income from capital gains (short term or long term) through the sale of equity shares and equity mutual funds or dividend income, the surcharge will not exceed 15%, irrespective of the income range. While understanding the concept of surcharge, one must also know the term marginal relief. The concept of marginal relief kicks in when the amount of surcharge on income tax payable exceeds the increase in income over the specified limit.Suppose an individual has a net taxable income of Rs","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":249,"to":249}}}}],["54",{"pageContent":"must also know the term marginal relief. The concept of marginal relief kicks in when the amount of surcharge on income tax payable exceeds the increase in income over the specified limit.Suppose an individual has a net taxable income of Rs 51,00,000. As the income exceeds Rs 50 lakh, the surcharge will be applicable at the rate of 10%. The tax payable on Rs 51,00,000 (without surcharge) is Rs 13,42,500. The surcharge amount will be Rs 1,34,250.Here the surcharge amount (Rs 1,34,250) is higher than the additional income above Rs 50 lakh (Rs 1,00,000). This is where the concept of marginal","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":249,"to":249}}}}],["55",{"pageContent":"Rs 51,00,000 (without surcharge) is Rs 13,42,500. The surcharge amount will be Rs 1,34,250.Here the surcharge amount (Rs 1,34,250) is higher than the additional income above Rs 50 lakh (Rs 1,00,000). This is where the concept of marginal relief kicks in.To know the amount of marginal relief that is applicable, one needs to calculate income tax payable on Rs 50 lakh. This is because no surcharge will be applicable till the income exceeds Rs 50 lakh. The income tax payable will be Rs 13,12,500. Now add income above Rs 50 lakh (Rs 1 lakh) to the income tax payable amount. The tax payable amount","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":249,"to":249}}}}],["56",{"pageContent":"on Rs 50 lakh. This is because no surcharge will be applicable till the income exceeds Rs 50 lakh. The income tax payable will be Rs 13,12,500. Now add income above Rs 50 lakh (Rs 1 lakh) to the income tax payable amount. The tax payable amount under marginal relief will be Rs 14,12,500.To ascertain the actual income tax payable with surcharge, compare the normal tax liability (before surcharge and cess) and tax liability after marginal tax relief (without cess). Normal tax liability is Rs 13,42,500 and tax liability after marginal tax relief is Rs 14,12,500. The surcharge that will be","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":249,"to":249}}}}],["57",{"pageContent":"the normal tax liability (before surcharge and cess) and tax liability after marginal tax relief (without cess). Normal tax liability is Rs 13,42,500 and tax liability after marginal tax relief is Rs 14,12,500. The surcharge that will be applicable is Rs 70,000 (Rs 14,12,500 - Rs 13,42,500).The final tax payable amount will be Rs 13,42, 500 (Tax payable amount) + Rs 70,000 (Surcharge) + Rs 56,500 (Cess at 4% on Rs 14,12,500) = Rs 14,69,000.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":249,"to":249}}}}],["58",{"pageContent":"Income tax slabs for FY 2021-22 (AY 2022-23) FY 2022-23 (AY 2023-24) under new tax regime Effective from April 1, 2020 (FY 2020-21), an individual has an option to continue with the old tax regime (claim deductions and tax exemptions) or opt for the new tax regime without any deductions and tax exemptions. The new tax regime, optional in nature, offers lower tax rate as compared to the old tax regime. Here are latest income tax slabs and rates applicable for FY 2021- 22 (AY 2022-23) and FY 2022-23 (AY 2023-24) Income tax rates and slabs in new tax regime for FY 2021-22, FY 2022-23","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":251,"to":251}}}}],["59",{"pageContent":"Income tax slabs Income tax rates\r\n\r\nUp to Rs 2,50,000 Nil\r\n\r\nRs 2,50,001 to Rs 5,00,000 5% of (total income minus Rs 2,50,000)\r\n\r\nRs 5,00,001 to Rs 7,50,000 Rs 12,500 + 10% of (total income minus Rs 5,00,000)\r\n\r\nRs 7,50,001 to Rs 10,00,000 Rs 37,500 + 15% of (total income minus Rs 7,50,000)\r\n\r\nRs 10,00,001 to Rs 12,50,000 Rs 75,000 + 20% of (total income minus Rs 10,00,000)\r\n\r\n12,50,001 to 15,00,000 Rs 1,25,000 + 25% of (total income minus Rs 12,50,000)","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":253,"to":265}}}}],["60",{"pageContent":"Rs 10,00,001 to Rs 12,50,000 Rs 75,000 + 20% of (total income minus Rs 10,00,000)\r\n\r\n12,50,001 to 15,00,000 Rs 1,25,000 + 25% of (total income minus Rs 12,50,000)\r\n\r\nAbove 15,00,001 Rs 1,87,500 + 30% of (total income minus Rs 15,00,000)","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":265,"to":269}}}}],["61",{"pageContent":"12,50,001 to 15,00,000 Rs 1,25,000 + 25% of (total income minus Rs 12,50,000)\r\n\r\nAbove 15,00,001 Rs 1,87,500 + 30% of (total income minus Rs 15,00,000)\r\n\r\nComparison of new income tax regime with old tax regimeThe new tax regime effective from April 1, 2020, co-exists with the old/existing tax regime. The new tax regime offers lower, concessional tax rates vis-a-vis the income tax rates offered in the existing tax rates.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":269,"to":273}}}}],["62",{"pageContent":"Claiming deductions of more than Rs 2.5 lakh? You won’t gain from moving to the new tax regimeAnyone claiming tax exemptions of more than Rs 2.5 lakh in a year will not gain from the new structure.\r\n\r\nWhat are income tax rates and slabs under the new tax regime?","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":275,"to":277}}}}],["63",{"pageContent":"What are income tax rates and slabs under the new tax regime?\r\nIf you are planning to opt for a new tax regime in the ongoing financial year 2021-22, then here are the income tax rates and slabs under the new tax regime. Do keep in mind that you will have to forego approximately 70 tax deductions and exemptions by opting for new tax regime.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":277,"to":278}}}}],["64",{"pageContent":"These individuals can't switch between old and new income tax regimes every yearAn individual has option to switch between new and old tax regimes every year. In order to be eligible to opt for the preferred tax structure as per an individual's convenience, there is one condition that must be satisfied. Read on to know more about it.\r\n\r\nIncome tax slab FAQs\r\n\r\nWho has to pay income tax?","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":280,"to":284}}}}],["65",{"pageContent":"Income tax slab FAQs\r\n\r\nWho has to pay income tax?\r\n\r\nAn individual whose total income exceeds the exemption limit has to pay tax and mandatorily file ITR. The exemption limit applicable to an individual depends on the tax regime chosen by him/her.\r\n\r\nWhat is the basic exemption limit under the Income-tax Act?","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":284,"to":290}}}}],["66",{"pageContent":"What is the basic exemption limit under the Income-tax Act?\r\n\r\nMaximum amount of income on which tax is not required to be paid is the basic exemption limit under the Income-tax Act. Under the old tax regime, for individual below 60 years of age the basic exemption limit is Rs 2.5 lakh. For senior citizens and super senior citizens, the basic exemption limit is Rs 3 lakh and Rs 5 lakh, respectively. Under the new tax regime, the basic exemption limit is Rs 2.5 lakh irrespective of the age.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":290,"to":292}}}}],["67",{"pageContent":"How much income is exempt from tax for senior citizens?","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":294,"to":294}}}}],["68",{"pageContent":"Income that is exempt from tax for senior citizens in a financial year depends on the tax regime chosen. If a senior citizen or super senior citizen opts for the old, existing tax regime in a financial year, then income that is exempt will be up to Rs 3 lakh and Rs 5 lakh, respectively. However, if a senior citizen or super senior citizen opts for the new, concessional tax regime then income that will be exempt is Rs 2.5 lakh, irrespective of age.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":296,"to":296}}}}],["69",{"pageContent":"When is surcharge levied on income tax amount?\r\n\r\nSurcharge is levied on the income tax amount if the total income of a taxpayer exceeds specified limits.\r\n\r\nCan a Hindu Undivided Family (HUF) opt for the new income tax regime?\r\n\r\nYes, a HUF can opt for the new income tax regime in a financial year.\r\n\r\nWho is eligible for rebate under section 87A of the Income-tax Act, 1961?","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":298,"to":306}}}}],["70",{"pageContent":"Yes, a HUF can opt for the new income tax regime in a financial year.\r\n\r\nWho is eligible for rebate under section 87A of the Income-tax Act, 1961?\r\n\r\nA resident individual whose net taxable income does not exceed Rs 5 lakh in a financial year is eligible for rebate up to Rs 5 lakh. A rebate of maximum up to Rs 12,500 is available. This makes the tax payable amount under both tax regimes for an individual as zero.\r\n\r\nIs there any deduction that can be claimed under the new tax regime?","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":306,"to":312}}}}],["71",{"pageContent":"Is there any deduction that can be claimed under the new tax regime?\r\n\r\nYes, an individual opting for the new tax regime is eligible to claim deduction under section 80CCD (2) of the Income-tax Act, 1961. This deduction can be claimed if an employer makes NPS contribution into the employee's account. The maximum deduction that can be claimed is 10% of the basic salary. For government employees, the maximum deduction that can be claimed is 14%.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":312,"to":314}}}}],["72",{"pageContent":"Who will have to pay tax even if net income does not exceed Rs 5 lakh?\r\n\r\nAn NRI and HUF is not eligible for rebate under section 87A. Hence, even if their net taxable income does not exceed Rs 5 lakh, then they will have to pay tax.\r\n\r\nWhat are the incomes that are not taxable under the Income-tax Act?","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":316,"to":320}}}}],["73",{"pageContent":"What are the incomes that are not taxable under the Income-tax Act?\r\n\r\nIncomes that are not taxable are specifically mentioned under the Income-tax Act. Example of these are: interest earned from PPF account, interest earned from Sukanya Samriddhi Yojana Account, maturity amount from PPF or Sukanya Samriddhi account, agricultural income etc.\r\n\r\nIs pension taxable?\r\n\r\nYes, pension received by an individual is taxable. Even the family pension received is taxable.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":320,"to":326}}}}],["74",{"pageContent":"Is pension taxable?\r\n\r\nYes, pension received by an individual is taxable. Even the family pension received is taxable.\r\n \r\n\r\nExemptions and deductions not claimable under the new tax regime\r\n\r\nThe following are some of the major deductions and exemptions you cannot claim under the new tax system:\r\nThe standard deduction under Section 80TTA/80TTB \r\nProfessional tax and entertainment allowance on salaries\r\nLeave Travel Allowance (LTA)\r\nHouse Rent Allowance (HRA)\r\nMinor child income allowance","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":326,"to":338}}}}],["75",{"pageContent":"The standard deduction under Section 80TTA/80TTB \r\nProfessional tax and entertainment allowance on salaries\r\nLeave Travel Allowance (LTA)\r\nHouse Rent Allowance (HRA)\r\nMinor child income allowance\r\nHelper allowance\r\nChildren education allowance\r\nOther special allowances [Section 10(14)]\r\nInterest on housing loan on the self-occupied property or vacant property (Section 24)\r\nChapter VI-A deduction (Section 80C, 80D, 80E and so on, except Section 80CCD(2) and Section 80JJAA)","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":338,"to":347}}}}],["76",{"pageContent":"Interest on housing loan on the self-occupied property or vacant property (Section 24)\r\nChapter VI-A deduction (Section 80C, 80D, 80E and so on, except Section 80CCD(2) and Section 80JJAA)\r\nExemption or deduction for any other perquisites or allowances including food allowance of Rs 50/meal subject to 2 meals a day\r\nEmployee's (own) contribution to NPS\r\nDonation to Political party/trust, etc\r\n\r\nWhat are the exemptions and deductions available under the new regime?","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":347,"to":353}}}}],["77",{"pageContent":"Employee's (own) contribution to NPS\r\nDonation to Political party/trust, etc\r\n\r\nWhat are the exemptions and deductions available under the new regime?\r\n\r\nUnder New tax regime, you can claim tax exemption for the following:\r\nTransport allowances in case of a specially-abled person.\r\nConveyance allowance received to meet the conveyance expenditure incurred as part of the employment.\r\nAny compensation received to meet the cost of travel on tour or transfer.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":353,"to":361}}}}],["78",{"pageContent":"Conveyance allowance received to meet the conveyance expenditure incurred as part of the employment.\r\nAny compensation received to meet the cost of travel on tour or transfer.\r\nDaily allowance received to meet the ordinary regular charges or expenditure you incur on account of absence from his regular place of duty.\r\nPerquisites for official purposes\r\nExemption on voluntary retirement 10(10C), gratuity u/s 10(10) and Leave encashment u/s 10(10AA)","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":361,"to":365}}}}],["79",{"pageContent":"Perquisites for official purposes\r\nExemption on voluntary retirement 10(10C), gratuity u/s 10(10) and Leave encashment u/s 10(10AA)\r\nInterest on Home Loan on let-out property (Section 24)\r\nGifts up to Rs 5,000\r\nDeduction for employer’s contribution to NPS account [Section 80CCD(2)]\r\nDeduction for additional employee cost (Section 80JJA)\r\n\r\n\r\nHOME\r\nINCOME-TAX\r\nEFILING-INCOME-TAX-RETURN\r\nSECTION 115BAC OF INCOME TAX ACT: DEDUCTIONS ALLOWED, EXEMPTIONS, FEATURES OF THE NEW TAX REGIME AND ITS BENEFITS","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":365,"to":376}}}}],["80",{"pageContent":"HOME\r\nINCOME-TAX\r\nEFILING-INCOME-TAX-RETURN\r\nSECTION 115BAC OF INCOME TAX ACT: DEDUCTIONS ALLOWED, EXEMPTIONS, FEATURES OF THE NEW TAX REGIME AND ITS BENEFITS\r\nSection 115BAC of Income Tax Act: Deductions Allowed, Exemptions, Features of the New Tax Regime and Its Benefits\r\nUpdated on: Apr 13th, 2023\r\n\r\n | \r\n\r\n29 min read\r\n\r\nsocial icons\r\nsocial icons\r\nsocial icons\r\nsocial icons\r\nLatest update: Budget 2023 changes under new tax regime","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":376,"to":391}}}}],["81",{"pageContent":"Updated on: Apr 13th, 2023\r\n\r\n | \r\n\r\n29 min read\r\n\r\nsocial icons\r\nsocial icons\r\nsocial icons\r\nsocial icons\r\nLatest update: Budget 2023 changes under new tax regime\r\nNew tax regime will be the default tax regime. However, taxpayers can opt for the old regime\r\nA tax rebate has been introduced under the new tax regime on income up to Rs.7 lakhs. Therefore, you do not have to pay tax if your taxable income is below Rs.7 lakhs under the new tax regime","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":391,"to":403}}}}],["82",{"pageContent":"A tax rebate has been introduced under the new tax regime on income up to Rs.7 lakhs. Therefore, you do not have to pay tax if your taxable income is below Rs.7 lakhs under the new tax regime\r\nThe tax exemption limit of Rs.2.5 lakh has increased to Rs.3 lakh under the new tax regime and tax slabs have been recalibrated under the new tax regime as follows: \r\nUp to Rs.3 lakh: Nil\r\nRs.3 lakh-Rs.6 lakh: 5%\r\nRs.6 lakh-Rs.9 lakh: 10%\r\nRs.9 lakh-Rs.12 lakh: 15%\r\nRs.12 lakh-Rs.15 lakh: 20%","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":403,"to":409}}}}],["83",{"pageContent":"Up to Rs.3 lakh: Nil\r\nRs.3 lakh-Rs.6 lakh: 5%\r\nRs.6 lakh-Rs.9 lakh: 10%\r\nRs.9 lakh-Rs.12 lakh: 15%\r\nRs.12 lakh-Rs.15 lakh: 20%\r\nAbove Rs.15 lakh: 30%\r\nThe standard deduction of Rs 50,000 has been extended to the new tax regime as well\r\nThe highest surcharge rate of 37% has been reduced to 25% under the new tax regime. This move impacts taxpayers earning more than Rs 5 crore. As a result, their overall tax rate will decrease from 42.74% to 39%","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":409,"to":416}}}}],["84",{"pageContent":"From FY 2020-21, you can choose to pay income tax under an optional new tax regime. The new tax regime is available for individuals and HUFs with lower tax rates and fewer deductions/exemptions. We will discuss the features of the new tax regime and how you can benefit from it.\r\n\r\nWhat is Section 115BAC – the new tax regime?","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":417,"to":419}}}}],["85",{"pageContent":"What is Section 115BAC – the new tax regime?\r\nThe Budget 2020 introduces a new regime under section 115BAC giving individuals and HUF taxpayers an option to pay income tax at lower rates. The new system is applicable for income earned from 1 April 2020 (FY 2020-21), which relates to AY 2021-22.\r\n\r\nWhat are the tax rates under the new regime?","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":419,"to":422}}}}],["86",{"pageContent":"What are the tax rates under the new regime?\r\nIn Budget 2023, the income tax slabs under the new tax regime have been revised. The new tax slabs under the new tax regime for FY 2023-24 (AY 2024-25) are shown in the table below. The tax rates under the new tax regime for FY 2022-23 (AY 2023-24) are also tabulated below.\r\n\r\nPost-Budget new regime tax rates (FY 23-24)\tPre-Budget new regime tax rates (FY 22-23)\r\nIncome Slabs\tRates\tIncome Slabs\tRates\r\nUp to Rs 3 lakh\tNil\tUp to Rs.2.5 lakh\tNil","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":422,"to":427}}}}],["87",{"pageContent":"Post-Budget new regime tax rates (FY 23-24)\tPre-Budget new regime tax rates (FY 22-23)\r\nIncome Slabs\tRates\tIncome Slabs\tRates\r\nUp to Rs 3 lakh\tNil\tUp to Rs.2.5 lakh\tNil\r\nRs 3 lakh to Rs 6 lakh\t5%\tRs 2.5 lakh to Rs 5 lakh\t5%\r\nRs 6 lakh to Rs 9 lakh\t10%\tRs 5 lakh to Rs 7.5 lakh\t10%\r\nRs 9 lakh to Rs 12 lakh\t15%\tRs 7.5 lakh to Rs 10 lakh\t15%\r\nRs 12 lakh to Rs 15 lakh\t20%\tRs 10 lakh to Rs 12.5 lakh\t20%\r\nIncome above Rs 15 lakh\t30%\tRs 12.5 lakh to Rs 15 lakh\t25%\r\n \t \tIncome above Rs 15 lakh\t30%","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":427,"to":435}}}}],["88",{"pageContent":"Rs 12 lakh to Rs 15 lakh\t20%\tRs 10 lakh to Rs 12.5 lakh\t20%\r\nIncome above Rs 15 lakh\t30%\tRs 12.5 lakh to Rs 15 lakh\t25%\r\n \t \tIncome above Rs 15 lakh\t30%\r\nThe tax rates under the new tax regime and the old tax regime for FY 2022-23 (AY 2023-24) are compared below:\r\n\r\nTax rates under New tax regime 2022-23\tTax rates under Old tax regime 2022-23\r\nRs 2.5 lakh to Rs 5 lakh\t5%\tRs 2.5 lakh to Rs 5 lakh\t5%\r\nRs 5 lakh to Rs 7.5 lakh\t10%\tRs 5 lakh to Rs 10 lakh\t20%","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":435,"to":442}}}}],["89",{"pageContent":"Tax rates under New tax regime 2022-23\tTax rates under Old tax regime 2022-23\r\nRs 2.5 lakh to Rs 5 lakh\t5%\tRs 2.5 lakh to Rs 5 lakh\t5%\r\nRs 5 lakh to Rs 7.5 lakh\t10%\tRs 5 lakh to Rs 10 lakh\t20%\r\nRs 7.5 lakh to Rs 10 lakh\t15%\tIncome above Rs 10 lakh\t30%\r\nRs 10 lakh to Rs 12.5 lakh\t20%\t \r\nRs 12.5 lakh to Rs 15 lakh\t25%\r\nIncome above Rs 15 lakh\t30%\r\nThe new tax regime does not allow 70 deductions and exemptions (discussed in para 4).","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":442,"to":449}}}}],["90",{"pageContent":"Rs 10 lakh to Rs 12.5 lakh\t20%\t \r\nRs 12.5 lakh to Rs 15 lakh\t25%\r\nIncome above Rs 15 lakh\t30%\r\nThe new tax regime does not allow 70 deductions and exemptions (discussed in para 4). \r\n\r\nThe tax payable under both the new and the old regimes without claiming deductions and exemptions for FY 2022-23 (AY 2023-24) is as below:\r\n\r\nAnnual income^\tTax under the old regime (Rs)\tTax under the new regime (Rs)\tTax savings under the new regime (Rs)\r\nUp to Rs 7,50,000\t65,000\t39,000\t26,000","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":449,"to":457}}}}],["91",{"pageContent":"Annual income^\tTax under the old regime (Rs)\tTax under the new regime (Rs)\tTax savings under the new regime (Rs)\r\nUp to Rs 7,50,000\t65,000\t39,000\t26,000\r\nUp to Rs 10,00,000\t117,000\t78,000\t39,000\r\nUp to Rs 12,50,000\t195,000\t130,000\t65,000\r\nUp to Rs 15,00,000\t273,000\t195,000\t78,000\r\n^ Assuming same annual income as base for both regimes which is usually is not the case, since standard deduction and many more deductions/exemptions would not be allowed for new tax regime.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":457,"to":462}}}}],["92",{"pageContent":"^ Assuming same annual income as base for both regimes which is usually is not the case, since standard deduction and many more deductions/exemptions would not be allowed for new tax regime.\r\n\r\nThe above table shows that the new tax regime generally saves taxes for taxpayers who don’t claim any deductions or exemptions.\r\n\r\nThe tax payable under both the new and the old regimes without claiming deductions and exemptions for FY 2023-24 (AY 2024-25) is as below:","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":462,"to":466}}}}],["93",{"pageContent":"The tax payable under both the new and the old regimes without claiming deductions and exemptions for FY 2023-24 (AY 2024-25) is as below:\r\n\r\nAnnual income*\tTax under the old regime (Rs)\tTax under the new regime (Rs)\tTax savings under the new regime (Rs)\r\nUp to Rs 7,50,000\t65,000\t31,200\t33,800\r\nUp to Rs 10,00,000\t117,000\t62,400\t54,600\r\nUp to Rs 12,50,000\t195,000\t1,04,000\t65,000\r\nUp to Rs 15,00,000\t273,000\t1,56,000\t1,17,000","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":466,"to":472}}}}],["94",{"pageContent":"Up to Rs 7,50,000\t65,000\t31,200\t33,800\r\nUp to Rs 10,00,000\t117,000\t62,400\t54,600\r\nUp to Rs 12,50,000\t195,000\t1,04,000\t65,000\r\nUp to Rs 15,00,000\t273,000\t1,56,000\t1,17,000\r\n*Assumed that the annual income is after considering the standard deduction under both old and new regimes.\r\n\r\nExemptions and deductions not claimable under the new tax regime\r\nThe following are some of the major deductions and exemptions you cannot claim under the new tax system:\r\n\r\nThe standard deduction under Section 80TTA/80TTB","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":472,"to":481}}}}],["95",{"pageContent":"The following are some of the major deductions and exemptions you cannot claim under the new tax system:\r\n\r\nThe standard deduction under Section 80TTA/80TTB \r\nProfessional tax and entertainment allowance on salaries\r\nLeave Travel Allowance (LTA)\r\nHouse Rent Allowance (HRA)\r\nMinor child income allowance\r\nHelper allowance\r\nChildren education allowance\r\nOther special allowances [Section 10(14)]\r\nInterest on housing loan on the self-occupied property or vacant property (Section 24)","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":481,"to":491}}}}],["96",{"pageContent":"Helper allowance\r\nChildren education allowance\r\nOther special allowances [Section 10(14)]\r\nInterest on housing loan on the self-occupied property or vacant property (Section 24)\r\nChapter VI-A deduction (Section 80C, 80D, 80E and so on, except Section 80CCD(2) and Section 80JJAA)\r\nExemption or deduction for any other perquisites or allowances including food allowance of Rs 50/meal subject to 2 meals a day\r\nEmployee's (own) contribution to NPS\r\nDonation to Political party/trust, etc","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":491,"to":498}}}}],["97",{"pageContent":"Employee's (own) contribution to NPS\r\nDonation to Political party/trust, etc\r\nBudget 2023 update- Deduction from family pension income only for years up to FY 2022-23 (From FY 2023-24, this is allowed as deduction)\r\nBudget 2023 update- Standard deduction of Rs.50,000 only for years up to FY 2022-23 (From FY 2023-24, this is allowed as deduction)\r\nWhat are the exemptions and deductions available under the new regime?\r\nUnder New tax regime, you can claim tax exemption for the following:","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":604,"to":609}}}}],["98",{"pageContent":"What are the exemptions and deductions available under the new regime?\r\nUnder New tax regime, you can claim tax exemption for the following:\r\n\r\nTransport allowances in case of a specially-abled person.\r\nConveyance allowance received to meet the conveyance expenditure incurred as part of the employment.\r\nAny compensation received to meet the cost of travel on tour or transfer.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":609,"to":614}}}}],["99",{"pageContent":"Conveyance allowance received to meet the conveyance expenditure incurred as part of the employment.\r\nAny compensation received to meet the cost of travel on tour or transfer.\r\nDaily allowance received to meet the ordinary regular charges or expenditure you incur on account of absence from his regular place of duty.\r\nPerquisites for official purposes\r\nExemption on voluntary retirement 10(10C), gratuity u/s 10(10) and Leave encashment u/s 10(10AA)","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":614,"to":618}}}}],["100",{"pageContent":"Perquisites for official purposes\r\nExemption on voluntary retirement 10(10C), gratuity u/s 10(10) and Leave encashment u/s 10(10AA)\r\nInterest on Home Loan on let-out property (Section 24)\r\nGifts up to Rs 5,000\r\nDeduction for employer’s contribution to NPS account [Section 80CCD(2)]\r\nDeduction for additional employee cost (Section 80JJA)\r\nBudget 2023 introduced a standard deduction of Rs 50,000 under New Tax Regime applicable from FY 2023-24","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":725,"to":731}}}}],["101",{"pageContent":"Deduction for additional employee cost (Section 80JJA)\r\nBudget 2023 introduced a standard deduction of Rs 50,000 under New Tax Regime applicable from FY 2023-24\r\nBudget 2023 also introduced deduction under Section 57(iia) of family pension income\r\nBudget 2023 further introduced deduction of amount paid or deposited in the Agniveer Corpus Fund under Section 80CCH(2)\r\nHere's a detailed list of exemptions and deductions available under Old vs New Regime.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":731,"to":735}}}}],["102",{"pageContent":"Here's a detailed list of exemptions and deductions available under Old vs New Regime.\r\n\r\nCan I choose between the new tax regime and the existing regime?\r\n\r\nA salaried taxpayer can choose the new tax regime at the beginning of FY 2023-24 and intimate their employer. The employee cannot change their choice anytime during the financial year. However, they can change their choice when filing the income tax return in July 2024.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":735,"to":739}}}}],["103",{"pageContent":"The due date for tax filing for the FY 2022-23 (AY 2023-24) is 31st July 2023.\r\nIn case an employee does not choose the new tax regime at the beginning of the financial year, the employer will deduct tax (TDS) under the existing tax regime. A salaried taxpayer can choose the new tax regime in one year and choose the regular tax regime in another year.","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":740,"to":741}}}}],["104",{"pageContent":"A non-salaried taxpayer has to choose the new regime when filing the tax return. They need not declare or intimate their choice to anyone during the year. However, a non-salaried taxpayer (taxpayers with an income from business or profession) cannot opt-in and opt-out of the new tax regime every year. Once a non-salaried opts out of the new tax regime, they cannot opt-in again for the new tax regime in the future.\r\n\r\n\r\nLinks to refer:","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":742,"to":745}}}}],["105",{"pageContent":"Links to refer:\r\nhttps://www.hdfcbank.com/personal/resources/learning-centre/pay/difference-between-new-tax-regime-vs-old-tax-regime\r\nhttps://economictimes.indiatimes.com/wealth/income-tax-slabs\r\nhttps://www.bankbazaar.com/tax/income-tax-slabs.html\r\nhttps://cleartax.in/s/section-115bac-features-new-tax-regime-benefits","metadata":{"source":"./textfiles/Text1.txt","loc":{"lines":{"from":745,"to":749}}}}]]